Repository: stanislav-mishkevich/Bools-2.0
Catalog: Bools/Bools/*.lproj/Localizable.strings
Languages: ru

# gate.desc.demux_1to4
source: Demultiplexer 1:4 - routes to 1 of 4 outputs
ru: Демультиплексор 1:4 - направляет на 1 из 4 выходов

# gate.counter_4bit
source: 4-bit Counter
ru: Счетчик 4-бит

# gate.register_4bit
source: 4-bit Register
ru: Регистр 4-бит

# gate.desc.counter_4bit
source: 4-bit counter - counts pulses
ru: 4-битный счетчик - считает импульсы

# gate.desc.register_4bit
source: 4-bit register - stores 4 bits
ru: 4-битный регистр - хранит 4 бита

# gate.half_adder
source: Half Adder
ru: Полусумматор

# gate.full_adder
source: Full Adder
ru: Полный сумматор

# gate.adder_4bit
source: 4-bit Adder
ru: Сумматор 4-бит

# gate.desc.half_adder
source: Half Adder - adds 2 bits
ru: Полусумматор - складывает 2 бита

# gate.desc.full_adder
source: Full Adder - adds 3 bits
ru: Полный сумматор - складывает 3 бита

# gate.desc.adder_4bit
source: 4-bit Adder - adds 4-bit numbers
ru: 4-битный сумматор - складывает 4-битные числа

# gate.decoder_2to4
source: 2:4 Decoder
ru: Декодер 2:4

# gate.decoder_3to8
source: 3:8 Decoder
ru: Декодер 3:8

# gate.encoder_4to2
source: 4:2 Encoder
ru: Энкодер 4:2

# gate.desc.decoder_2to4
source: 2:4 Decoder - converts 2 bits to 4 lines
ru: Декодер 2:4 - преобразует 2 бита в 4 линии

# gate.desc.decoder_3to8
source: 3:8 Decoder - converts 3 bits to 8 lines
ru: Декодер 3:8 - преобразует 3 бита в 8 линий

# gate.desc.encoder_4to2
source: 4:2 Encoder - converts 4 lines to 2 bits
ru: Энкодер 4:2 - преобразует 4 линии в 2 бита

# gate.comparator_1bit
source: 1-bit Comparator
ru: Компаратор 1-бит

# gate.comparator_4bit
source: 4-bit Comparator
ru: Компаратор 4-бит

# gate.desc.comparator_1bit
source: 1-bit Comparator - compares A and B
ru: 1-битный компаратор - сравнивает A и B

# gate.desc.comparator_4bit
source: 4-bit Comparator - compares 4-bit numbers
ru: 4-битный компаратор - сравнивает 4-битные числа

# gate.desc.ram_4x4
source: RAM 4×4 - 4 words × 4 bits memory
ru: RAM 4×4 - оперативная память 4 слова × 4 бита

# gate.desc.rom_4x4
source: ROM 4×4 - 4 words × 4 bits ROM
ru: ROM 4×4 - постоянная память 4 слова × 4 бита

# gate.splitter_4bit
source: 4-bit Splitter
ru: Разветвитель 4-бит

# gate.combiner_4bit
source: 4-bit Combiner
ru: Объединитель 4-бит

# gate.desc.splitter_4bit
source: 4-bit bus splitter
ru: Разветвитель 4-битной шины

# gate.desc.combiner_4bit
source: 4-bit bus combiner
ru: Объединитель в 4-битную шину

# example.dFlipFlopCounter.name
source: D Flip-Flop Counter
ru: Счетчик на D-триггерах

# example.dFlipFlopCounter.desc
source: 2-bit counter using D flip-flops. Each flip-flop stores one bit and toggles on clock edge.
ru: 2-битный счетчик на D-триггерах. Каждый триггер хранит один бит и переключается по фронту тактового сигнала.

# example.dFlipFlopCounter.category
source: Flip-Flops & Latches
ru: Триггеры и защелки

# example.tFlipFlopToggle.name
source: T Flip-Flop Toggle
ru: Переключатель на T-триггере

# example.tFlipFlopToggle.desc
source: Toggle flip-flop: each button press toggles the output state. T input is always high.
ru: T-триггер: каждое нажатие кнопки переключает состояние выхода. Вход T всегда высокий.

# example.tFlipFlopToggle.category
source: Flip-Flops & Latches
ru: Триггеры и защелки

# example.jkFlipFlop.name
source: JK Flip-Flop
ru: JK-триггер

# example.jkFlipFlop.desc
source: JK flip-flop demonstration: J=1,K=0 sets; J=0,K=1 resets; J=1,K=1 toggles on clock edge.
ru: Демонстрация JK-триггера: J=1,K=0 устанавливает; J=0,K=1 сбрасывает; J=1,K=1 переключает по фронту CLK.

# example.jkFlipFlop.category
source: Flip-Flops & Latches
ru: Триггеры и защелки

# example.mux4to1.name
source: 4-to-1 Multiplexer
ru: Мультиплексор 4:1

# example.mux4to1.desc
source: Data selector: selects one of 4 inputs based on 2 select lines (S1S0: 00→D0, 01→D1, 10→D2, 11→D3).
ru: Селектор данных: выбирает один из 4 входов на основе 2 линий выбора (S1S0: 00→D0, 01→D1, 10→D2, 11→D3).

# example.mux4to1.category
source: Multiplexers & Demultiplexers
ru: Мультиплексоры и демультиплексоры

# example.demux1to4.name
source: 1-to-4 Demultiplexer
ru: Демультиплексор 1:4

# example.demux1to4.desc
source: Data distributor: routes input to one of 4 outputs based on 2 select lines (S1S0: 00→OUT0, 01→OUT1, 10→OUT2, 11→OUT3).
ru: Распределитель данных: направляет вход на один из 4 выходов на основе 2 линий выбора (S1S0: 00→OUT0, 01→OUT1, 10→OUT2, 11→OUT3).

# example.demux1to4.category
source: Multiplexers & Demultiplexers
ru: Мультиплексоры и демультиплексоры

# example.counter4bit.name
source: 4-Bit Counter
ru: 4-битный счетчик

# example.counter4bit.desc
source: 4-bit binary counter: counts from 0 to 15 on each clock pulse. Reset button clears to 0.
ru: 4-битный двоичный счетчик: считает от 0 до 15 при каждом тактовом импульсе. Кнопка сброса обнуляет счетчик.

# example.counter4bit.category
source: Counters & Registers
ru: Счетчики и регистры

# example.register4bit.name
source: 4-Bit Register
ru: 4-битный регистр

# example.register4bit.desc
source: 4-bit data register: stores 4-bit value when LOAD is high on clock edge. Outputs retain value until new load.
ru: 4-битный регистр данных: сохраняет 4-битное значение когда LOAD высокий по фронту тактового сигнала. Выходы сохраняют значение до новой загрузки.

# example.register4bit.category
source: Counters & Registers
ru: Счетчики и регистры

# example.decoder3to8.name
source: 3-to-8 Decoder
ru: Декодер 3:8

# example.decoder3to8.desc
source: Binary decoder: converts 3-bit binary input (0-7) to one-hot 8-bit output. Only one LED lights at a time.
ru: Двоичный декодер: преобразует 3-битный двоичный вход (0-7) в унитарный 8-битный выход. Загорается только один светодиод.

# example.decoder3to8.category
source: Decoders & Encoders
ru: Декодеры и энкодеры

# example.comparator4bit.name
source: 4-Bit Comparator
ru: 4-битный компаратор

# example.comparator4bit.desc
source: Compares two 4-bit numbers A and B. Shows: A>B, A=B, or A<B.
ru: Сравнивает два 4-битных числа A и B. Показывает: A>B, A=B или A<B.

# example.comparator4bit.category
source: Comparators
ru: Компараторы

# example.transistorSwitch.name
source: Transistor Switch
ru: Транзисторный переключатель

# example.transistorSwitch.desc
source: NPN transistor as a switch: pressing button allows current to flow from collector to emitter, lighting the LED.
ru: NPN транзистор как переключатель: нажатие кнопки позволяет току протекать от коллектора к эмиттеру, зажигая светодиод.

# example.transistorSwitch.category
source: Physical Components
ru: Физические компоненты
