Repository: stanislav-mishkevich/Bools-2.0
Catalog: Bools/Bools/*.lproj/Localizable.strings
Languages: ru

# toolbar.new
source: New
ru: Новый

# toolbar.save
source: Save
ru: Сохранить

# toolbar.quickSave
source: Quick Save
ru: Быстрое сохранение

# toolbar.load
source: Load
ru: Загрузить

# toolbar.undo
source: Undo
ru: Отменить

# toolbar.redo
source: Redo
ru: Повторить

# toolbar.zoomIn
source: Zoom In
ru: Увеличить

# toolbar.zoomOut
source: Zoom Out
ru: Уменьшить

# toolbar.reset
source: Reset
ru: Сбросить

# toolbar.examples
source: Examples
ru: Примеры

# toolbar.export
source: Export
ru: Экспорт

# toolbar.help.new
source: Create new workspace
ru: Создать новое рабочее пространство

# toolbar.help.save
source: Save workspace
ru: Сохранить рабочее пространство

# toolbar.help.quickSave
source: Quick save to Documents
ru: Быстрое сохранение в Документы

# toolbar.help.load
source: Open workspace
ru: Открыть рабочее пространство

# toolbar.help.undo
source: Undo (⌘Z)
ru: Отменить (⌘Z)

# toolbar.help.redo
source: Redo (⌘⇧Z)
ru: Повторить (⌘⇧Z)

# toolbar.help.zoomIn
source: Zoom in
ru: Увеличить масштаб

# toolbar.help.zoomOut
source: Zoom out
ru: Уменьшить масштаб

# toolbar.help.reset
source: Reset view
ru: Сбросить вид

# toolbar.help.examples
source: Load example circuits
ru: Загрузить примеры схем

# toolbar.help.export
source: Export workspace
ru: Экспортировать рабочее пространство

# toolbar.help.hideSidebar
source: Hide sidebar
ru: Скрыть боковую панель

# toolbar.help.showSidebar
source: Show sidebar
ru: Показать боковую панель

# toolbar.help.hideInspector
source: Hide inspector
ru: Скрыть инспектор

# toolbar.help.showInspector
source: Show inspector
ru: Показать инспектор

# export.json
source: Export as JSON...
ru: Экспортировать как JSON...

# export.image
source: Export as Image...
ru: Экспортировать как изображение...

# save.saved
source: Saved: %@
ru: Сохранено: %@

source: Save failed
ru: Ошибка сохранения

# save.quickFailed
source: Quick save failed
ru: Ошибка быстрого сохранения

# save.cannotFindDocuments
source: Cannot find Documents
ru: Не удалось найти папку Документы

# save.exported
source: Exported to: %@
ru: Экспортировано в: %@

# save.exportFailed
source: Export failed
ru: Ошибка экспорта

# save.pngDevelopment
source: PNG export: Feature in development
ru: Экспорт PNG: Функция в разработке

# save.pngNotAvailable
source: PNG export not available on iOS yet
ru: Экспорт PNG пока недоступен на iOS

# save.filePickerNotImplemented
source: File picker not implemented for iOS yet
ru: Выбор файла пока не реализован для iOS

# save.loaded
source: Loaded: %@
ru: Загружено: %@

# sidebar.title
source: Logic Gates
ru: Логические элементы

# sidebar.subtitle
source: Drag gates to the canvas
ru: Перетащите элементы на холст

# sidebar.search
source: Search gates...
ru: Поиск элементов...

# sidebar.section.io
source: Input/Output
ru: Вход/Выход

# sidebar.section.basic
source: Basic Gates
ru: Базовые элементы

# sidebar.section.advanced
source: Advanced Gates
ru: Расширенные элементы

# sidebar.section.special
source: Special Gates
ru: Специальные элементы

# sidebar.section.projection
source: Projection Gates
ru: Проекции

# sidebar.section.constant
source: Constants
ru: Константы

# sidebar.section.physical
source: Physical Components
ru: Физические компоненты

# sidebar.section.transistors
source: Transistors
ru: Транзисторы

# gate.input
source: Input
ru: ВХОД

# gate.output
source: Output
ru: ВЫХОД

# gate.clock
source: Clock
ru: ГЕНЕРАТОР

# gate.and
source: AND
ru: И

# gate.or
source: OR
ru: ИЛИ

# gate.not
source: NOT
ru: НЕ

# gate.not_b
source: NOT B
ru: НЕ B

# gate.xor
source: XOR
ru: Исключающее ИЛИ

# gate.xnor
source: XNOR
ru: Эквивалентность

# gate.nand
source: NAND
ru: И-НЕ

# gate.nor
source: NOR
ru: ИЛИ-НЕ

# gate.a_and_not_b
source: A AND NOT B
ru: A И НЕ B

# gate.not_a_and_b
source: NOT A AND B
ru: НЕ A И B

# gate.const0
source: FALSE
ru: ЛОЖЬ

# gate.const1
source: TRUE
ru: ИСТИНА

# gate.button
source: Button
ru: Кнопка

# gate.switch
source: Switch
ru: Переключатель

# gate.led
source: LED
ru: Светодиод

# gate.bulb
source: Light Bulb
ru: Лампочка

# gate.relay
source: Relay
ru: Реле

# gate.buzzer
source: Buzzer
ru: Зуммер

# gate.resistor
source: Resistor
ru: Резистор

# gate.capacitor
source: Capacitor
ru: Конденсатор

# gate.battery
source: Battery
ru: Батарея

# gate.display8bit
source: 8-bit Display
ru: 8-битный дисплей

# gate.bjt_npn
source: BJT NPN
ru: Транзистор NPN

# gate.bjt_pnp
source: BJT PNP
ru: Транзистор PNP

# gate.mosfet_n
source: MOSFET N-channel
ru: MOSFET N-канальный

# gate.mosfet_p
source: MOSFET P-channel
ru: MOSFET P-канальный

# gate.desc.input
source: Input signal source
ru: Источник входного сигнала

# gate.desc.output
source: Output signal display
ru: Отображение выходного сигнала

# gate.desc.clock
source: Clock generator - produces periodic pulses
ru: Автоматический генератор импульсов - переключается между 0 и 1 каждую секунду

# gate.desc.and
source: Output is TRUE when all inputs are TRUE
ru: Выход ИСТИНА, когда все входы ИСТИНА

# gate.desc.or
source: Output is TRUE when at least one input is TRUE
ru: Выход ИСТИНА, когда хотя бы один вход ИСТИНА

# gate.desc.not
source: Inverts the input signal
ru: Инвертирует входной сигнал

# gate.desc.not_b
source: Inverts input B
ru: Инвертирует вход B

# gate.desc.xor
source: Output is TRUE when inputs differ
ru: Выход ИСТИНА, когда входы различаются

# gate.desc.xnor
source: Output is TRUE when inputs are equal
ru: Выход ИСТИНА, когда входы равны

# gate.desc.nand
source: NOT AND - opposite of AND gate
ru: НЕ-И - противоположность элемента И

# gate.desc.nor
source: NOT OR - opposite of OR gate
ru: НЕ-ИЛИ - противоположность элемента ИЛИ

# gate.desc.a_and_not_b
source: A AND NOT B - inhibition
ru: A И НЕ B - запрет

# gate.desc.not_a_and_b
source: NOT A AND B - inhibition
ru: НЕ A И B - запрет

# gate.desc.impl_ab
source: Implication A → B
ru: Импликация A → B

# gate.desc.impl_ba
source: Implication B → A
ru: Импликация B → A

# gate.desc.proj_a
source: Projection A - outputs A
ru: Проекция A - выводит A

# gate.desc.proj_b
source: Projection B - outputs B
ru: Проекция B - выводит B

# gate.desc.const0
source: Constant 0 - always FALSE
ru: Константа 0 - всегда ЛОЖЬ

# gate.desc.const1
source: Constant 1 - always TRUE
ru: Константа 1 - всегда ИСТИНА

# gate.desc.button
source: Button - closes contacts when pressed, opens when released
ru: Кнопка - замыкает контакты при нажатии, размыкает при отпускании

# gate.desc.switch
source: Switch - maintains ON/OFF state until next toggle
ru: Переключатель - фиксирует состояние ON/OFF до следующего переключения

# gate.desc.led
source: LED - glows green when signal 1 is applied
ru: Светодиод - загорается зелёным при подаче сигнала 1

# gate.desc.bulb
source: Light Bulb - glows yellow when voltage is applied
ru: Лампа накаливания - загорается жёлтым светом при подаче напряжения

# gate.desc.relay
source: Relay - electromagnetic device with switching contacts (COM, NO, NC)
ru: Реле - электромагнитное устройство с переключающими контактами (COM, NO, NC)

# gate.desc.buzzer
source: Buzzer - emits sound signal and shows sound waves
ru: Зуммер - издаёт звуковой сигнал и показывает звуковые волны

# gate.desc.resistor
source: Resistor - passive element with color bands, limits current
ru: Резистор - пассивный элемент с цветными полосами, ограничивает ток

# gate.desc.capacitor
source: Capacitor - passive element with two plates, stores charge
ru: Конденсатор - пассивный элемент из двух пластин, накапливает заряд

# gate.desc.battery
source: Battery - power source with constant output (always outputs 1)
ru: Батарея - источник питания с постоянным выходом (всегда выводит 1)

# gate.desc.display8bit
source: 8-bit Display - shows decimal value (0-255) from 8 binary inputs
ru: 8-битный дисплей - отображает десятичное число (0-255) от 8 двоичных входов

# gate.desc.bjt_npn
source: BJT NPN - bipolar transistor controlled by base current
ru: Транзистор NPN - биполярный транзистор, управляемый базовым током

# gate.desc.bjt_pnp
source: BJT PNP - bipolar transistor with inverted control logic
ru: Транзистор PNP - биполярный транзистор с инвертированной логикой управления

# gate.desc.mosfet_n
source: MOSFET N-channel - field-effect transistor for switching
ru: MOSFET N-канальный - полевой транзистор для коммутации

# gate.desc.mosfet_p
source: MOSFET P-channel - field-effect transistor with inverted logic
ru: MOSFET P-канальный - полевой транзистор с инвертированной логикой

# gate.longDesc.input
source: Input — sets a logical value (on/off). Used as a signal source.
ru: Вход — задаёт логическое значение (включено/выключено). Используется как источник сигнала.

# gate.longDesc.clock
source: Clock Generator — automatically generates periodic pulses by switching between 0 and 1 every second. Perfect for creating blinking lights, repeating sounds, or any cyclic circuit. Works like a metronome for digital circuits.
ru: Генератор импульсов — автоматически генерирует периодические импульсы, переключаясь между 0 и 1 каждую секунду. Идеален для создания мигающих огней, повторяющихся звуков или любых циклических схем. Работает как метроном для цифровых схем.

# gate.longDesc.output
source: Output — displays the current logical signal at this pin. Usually used to display the result.
ru: Выход — отображает текущий логический сигнал на этом выводе. Обычно используется для отображения результата.

# gate.longDesc.and
source: Logical AND — outputs 1 only if all inputs are 1.
ru: Логическое И — выдаёт 1 только если все входы равны 1.

# gate.longDesc.or
source: Logical OR — outputs 1 if at least one input is 1.
ru: Логическое ИЛИ — выдаёт 1 если хотя бы один вход равен 1.

# gate.longDesc.not
source: Inverter (NOT) — outputs the opposite value of the input.
ru: Инвертор (НЕ) — выдаёт противоположное значение входа.

# gate.longDesc.not_b
source: Inverter B (NOT B) — outputs the opposite value of input B.
ru: Инвертор B (НЕ B) — выдаёт противоположное значение входа B.

# gate.longDesc.xor
source: Exclusive OR — outputs 1 if exactly one of the inputs is 1.
ru: Исключающее ИЛИ — выдаёт 1 если ровно одно из входов равно 1.

# gate.longDesc.xnor
source: Equivalence (XNOR) — outputs 1 if inputs are equal (both 0 or both 1).
ru: Эквивалентность (XNOR) — выдаёт 1 если входы равны (оба 0 или оба 1).

# gate.longDesc.nand
source: Negation AND (NAND) — gives 0 only if all inputs are 1; otherwise 1.
ru: Отрицание И (NAND) — даёт 0 только если все входы равны 1; иначе 1.

# gate.longDesc.nor
source: Negation OR (NOR) — gives 1 only if all inputs are 0; otherwise 0.
ru: Отрицание ИЛИ (NOR) — даёт 1 только если все входы равны 0; иначе 0.

# gate.longDesc.a_and_not_b
source: A AND NOT B — outputs 1 only if A=1 and B=0.
ru: A И НЕ B — выдаёт 1 только если A=1 и B=0.

# gate.longDesc.not_a_and_b
source: NOT A AND B — outputs 1 only if A=0 and B=1.
ru: НЕ A И B — выдаёт 1 только если A=0 и B=1.

# gate.longDesc.impl_ab
source: Implication A→B — logical implication. False only if A=1 and B=0.
ru: Импликация A→B — логическое следование. Ложь только если A=1 и B=0.

# gate.longDesc.impl_ba
source: Implication B→A — logical implication. False only if B=1 and A=0.
ru: Импликация B→A — логическое следование. Ложь только если B=1 и A=0.

# gate.longDesc.proj_a
source: Projection A — simply passes the value of input A to the output.
ru: Проекция A — просто передаёт значение входа A на выход.

# gate.longDesc.proj_b
source: Projection B — simply passes the value of input B to the output.
ru: Проекция B — просто передаёт значение входа B на выход.

# gate.longDesc.const0
source: Constant 0 (FALSE) — always outputs 0 regardless of any conditions.
ru: Константа 0 (ЛОЖЬ) — всегда выдаёт 0 независимо от любых условий.

# gate.longDesc.const1
source: Constant 1 (TRUE) — always outputs 1 regardless of any conditions.
ru: Константа 1 (ИСТИНА) — всегда выдаёт 1 независимо от любых условий.

# gate.longDesc.button
source: Button — a mechanical element for momentary circuit closure. Contacts close when pressed allowing current flow (signal 1), open when released (signal 0). Used for temporary device activation. Visualized in red color when pressed.
ru: Кнопка — механический элемент для кратковременного замыкания цепи. При нажатии контакты замыкаются и пропускают ток (сигнал 1), при отпускании размыкаются (сигнал 0). Используется для временного включения устройств. Визуализируется красным цветом в нажатом состоянии.

# gate.longDesc.switch
source: Switch — a mechanical element for fixed circuit closure/opening. Maintains its position (ON/OFF) until next toggle. When on, passes signal; when off, blocks it. Used for permanent power control.
ru: Переключатель — механический элемент для фиксированного замыкания/размыкания цепи. Сохраняет своё положение (ON/OFF) до следующего переключения. При включении пропускает сигнал, при выключении блокирует. Используется для постоянного управления питанием.

# gate.longDesc.led
source: LED (Light-Emitting Diode) — a semiconductor device that emits light when electric current passes through it. Glows green when logic 1 is applied, remains dark at 0. Has low power consumption and used as active state indicator.
ru: Светодиод (LED) — полупроводниковый прибор, излучающий свет при прохождении через него электрического тока. Загорается зелёным светом при подаче логической 1, остаётся тёмным при 0. Имеет низкое энергопотребление и используется как индикатор активного состояния.

# gate.longDesc.bulb
source: Light Bulb — a classic light source based on tungsten filament heating. Glows yellow-orange when voltage is applied, creates characteristic glow around it. Visual indicator of voltage presence in circuit with realistic glow effect.
ru: Лампа накаливания — классический источник света на основе нагрева вольфрамовой нити. Загорается жёлто-оранжевым светом при подаче напряжения, создаёт характерное свечение вокруг. Визуальный индикатор наличия напряжения в цепи с реалистичным эффектом свечения.

# gate.longDesc.relay
source: Relay — an electromagnetic device for circuit switching. Consists of a control coil (two contacts: + and -) and switching contacts. When voltage is applied to the coil, a magnetic field is created that switches the contacts: • COM (common) — connected to the signal source • NO (normally open) — closes when the coil is activated • NC (normally closed) — opens when the coil is activated Used to control high-power circuits with weak signals, for protection and switching between different sources.
ru: Реле — электромагнитное устройство для коммутации цепей. Состоит из катушки управления (два контакта: + и -) и переключающих контактов. При подаче напряжения на катушку создаётся магнитное поле, которое переключает контакты: • COM (общий) — подключён к источнику сигнала • NO (нормально открытый) — замыкается при активации катушки • NC (нормально закрытый) — размыкается при активации катушки Используется для управления мощными цепями слабым сигналом, защиты и переключения между разными источниками.

# gate.longDesc.buzzer
source: Buzzer — an electroacoustic device for sound signaling. Activates when voltage is applied, emits characteristic sound. Red indicator in center shows activity, expanding waves visualize sound propagation.
ru: Зуммер — электроакустический прибор для подачи звуковых сигналов. Активируется при подаче напряжения, издаёт характерный звук. Индикатор красного цвета в центре показывает активность, а расходящиеся волны визуализируют распространение звука.

# gate.longDesc.resistor
source: Resistor — a passive electronic component limiting current in circuit. Has color bands (orange, blue, red) for value designation. Converts electrical energy to heat. Passes signal unchanged, but in reality reduces voltage.
ru: Резистор — пассивный электронный компонент, ограничивающий силу тока в цепи. Имеет цветные полосы (оранжевая, синяя, красная) для обозначения номинала. Преобразует электрическую энергию в тепловую. Пропускает сигнал без изменений, но в реальности снижает напряжение.

# gate.longDesc.capacitor
source: Capacitor — a passive electronic component of two conducting plates separated by dielectric. Capable of storing and releasing electric charge. Used for filtering, voltage ripple smoothing and temporary energy storage. Passes signal through.
ru: Конденсатор — пассивный электронный компонент из двух проводящих пластин, разделённых диэлектриком. Способен накапливать и отдавать электрический заряд. Используется для фильтрации, сглаживания пульсаций напряжения и временного хранения энергии. Пропускает сигнал через себя.

# gate.longDesc.battery
source: Battery — a power source providing constant voltage output. Always outputs logical 1 (active signal). Has two pins: positive (+) and negative/ground (-). Used to power circuits and provide reference voltages in logical circuits.
ru: Батарея — источник питания, обеспечивающий постоянное напряжение на выходе. Всегда выводит логическую 1 (активный сигнал). Имеет два контакта: положительный (+) и отрицательный/земля (-). Используется для питания цепей и обеспечения опорных напряжений в логических схемах.

# gate.longDesc.display8bit
source: 8-bit Display — visualizes an 8-bit binary number as a decimal value (0-255). Inputs: B0-B7 for bits (B0 is least significant), + and - for power supply. Requires both + and - inputs to be connected (logic 1 for +, logic 0 for -). Calculates value as: B0×1 + B1×2 + B2×4 + ... + B7×128. Perfect for displaying counter values, arithmetic results, or any 8-bit data.
ru: 8-битный цифровой дисплей — визуализирует 8-битное двоичное число в виде десятичного значения (0-255). Входы: B0-B7 для битов (B0 - младший разряд), + и - для питания. Для работы требуется подключение обоих входов питания (1 для +, 0 для -). Вычисляет значение как: B0×1 + B1×2 + B2×4 + ... + B7×128. Идеален для отображения значений счетчиков, результатов арифметических операций или любых 8-битных данных.

# gate.longDesc.bjt_npn
source: BJT NPN Transistor — a three-terminal bipolar transistor for signal amplification and switching. Pins: Base (B) - control input, Collector (C) - input signal, Emitter (E) - output. When base receives signal 1, transistor conducts and passes signal from collector to emitter.
ru: Транзистор NPN - трёхвыводной биполярный транзистор для усиления и коммутации сигналов. Выводы: База (B) - управляющий вход, Коллектор (C) - входной сигнал, Эмиттер (E) - выход. Когда база получает сигнал 1, транзистор открывается и пропускает сигнал от коллектора к эмиттеру.

# gate.longDesc.bjt_pnp
source: BJT PNP Transistor — a three-terminal bipolar transistor with inverted logic. Pins: Base (B) - control input, Collector (C) - input signal, Emitter (E) - output. Conducts when base receives signal 0 (inverted control). Used for switching and amplification in complementary circuits.
ru: Транзистор PNP — трёхвыводной биполярный транзистор с инвертированной логикой. Выводы: База (B) - управляющий вход, Коллектор (C) - входной сигнал, Эмиттер (E) - выход. Проводит при подаче сигнала 0 на базу (инвертированное управление). Используется для коммутации и усиления в комплементарных схемах.

# gate.longDesc.mosfet_n
source: MOSFET N-channel — a field-effect transistor for fast switching and amplification. Pins: Gate (G) - control input, Drain (D) - input signal, Source (S) - output. Conducts when gate receives signal 1. Offers high input impedance and fast switching speed.
ru: MOSFET N-канальный — полевой транзистор для быстрой коммутации и усиления. Выводы: Затвор (G) - управляющий вход, Сток (D) - входной сигнал, Исток (S) - выход. Проводит при подаче сигнала 1 на затвор. Обладает высоким входным сопротивлением и быстрой скоростью переключения.

# gate.longDesc.mosfet_p
source: MOSFET P-channel — a field-effect transistor with inverted control logic. Pins: Gate (G) - control input, Drain (D) - input signal, Source (S) - output. Conducts when gate receives signal 0 (inverted control). Used for complementary CMOS logic circuits.
ru: MOSFET P-канальный — полевой транзистор с инвертированной логикой управления. Выводы: Затвор (G) - управляющий вход, Сток (D) - входной сигнал, Исток (S) - выход. Проводит при подаче сигнала 0 на затвор (инвертированное управление). Используется в комплементарных CMOS логических схемах.

# inspector.title
source: Inspector
ru: Инспектор

# inspector.gateType
source: Gate Type
ru: Тип элемента

# inspector.labelSuffix
source: Label Suffix
ru: Суффикс метки

# inspector.labelSuffix.placeholder
source: Enter suffix
ru: Введите суффикс

# inspector.position
source: Position
ru: Позиция

# inspector.componentValue
source: Component Value
ru: Значение компонента

# inspector.componentValue.resistor
source: Resistance (Ω, k, M)
ru: Сопротивление (Ω, k, M)

# inspector.componentValue.capacitor
source: Capacitance (F, µF, nF, pF)
ru: Ёмкость (F, µF, nF, pF)

# inspector.componentValue.battery
source: Voltage (V)
ru: Напряжение (V)

# inspector.componentValue.transistor
source: Model (e.g. 2N2222)
ru: Модель (например 2N2222)

# inspector.inputs
source: Inputs
ru: Входы

# inspector.outputs
source: Outputs
ru: Выходы

# inspector.description
source: Description
ru: Описание

# inspector.noDescription
source: No description available
ru: Описание отсутствует

# inspector.noSelection
source: No Selection
ru: Нет выбора

# inspector.noSelectionHint
source: Select a gate to view properties
ru: Выберите элемент для просмотра свойств

# inspector.multipleSelection
source: Multiple gates selected
ru: Выбрано несколько элементов

# inspector.multipleSelectionHint
source: Select a single gate to edit
ru: Выберите один элемент для редактирования

# inspector.pinCount
source: Pin Count
ru: Количество контактов

# inspector.pinValue
source: Value
ru: Значение

# inspector.gateProperties
source: Gate Properties
ru: Свойства элемента

# inspector.truthTable
source: Truth Table
ru: Таблица истинности

# inspector.inputValue
source: Input Value
ru: Входное значение

# inspector.valueTrue
source: True
ru: Истина

# inspector.valueFalse
source: False
ru: Ложь

# inspector.deleteGate
source: Delete Gate
ru: Удалить элемент

# contentview.tab.canvas
source: Canvas
ru: Холст

# contentview.tab.gates
source: Gates
ru: Элементы

# contentview.tab.inspector
source: Inspector
ru: Инспектор

# example.halfAdder.name
source: Half Adder
ru: Полусумматор

# example.halfAdder.desc
source: Half adder — adds two bits, outputs sum and carry
ru: Полусумматор — складывает два бита, выдаёт сумму и перенос

# example.halfAdder.category
source: Arithmetic
ru: Арифметика

# example.fullAdder.name
source: Full Adder
ru: Полный сумматор

# example.fullAdder.desc
source: Full adder — adds three bits (two operands + carry)
ru: Полный сумматор — складывает три бита (два слагаемых + перенос)

# example.fullAdder.category
source: Arithmetic
ru: Арифметика

# example.srLatch.name
source: SR Latch
ru: SR-триггер

# example.srLatch.desc
source: SR latch using NOR gates — basic memory with feedback
ru: SR-триггер на элементах NOR — базовая память с обратной связью

# example.srLatch.category
source: Cyclic Circuits
ru: Циклические схемы

# example.dFlipFlop.name
source: D Flip-Flop
ru: D-триггер

# example.dFlipFlop.desc
source: D flip-flop using NAND gates — synchronous memory, captures D value on CLK edge
ru: D-триггер на элементах NAND — синхронная память, запоминает значение D по фронту CLK

# example.dFlipFlop.category
source: Cyclic Circuits
ru: Циклические схемы

# example.ringOscillator.name
source: Ring Oscillator
ru: Кольцевой генератор

# example.ringOscillator.desc
source: Oscillator with three inverters — self-oscillating system, creates periodic signal through feedback
ru: Генератор на трёх инверторах — автоколебательная система, создаёт периодический сигнал через обратную связь
