Repository: stanislav-mishkevich/Bools-2.0
Catalog: Bools/Bools/*.lproj/Localizable.strings
Languages: ru

# example.ringOscillator.category
source: Cyclic Circuits
ru: Циклические схемы

# example.clockBlinker.name
source: Blinking LED
ru: Мигающий светодиод

# example.clockBlinker.desc
source: LED blinks automatically using CLOCK generator. LED turns on and off every second.
ru: Светодиод автоматически мигает с помощью генератора CLOCK. LED включается и выключается каждую секунду.

# example.clockBlinker.category
source: Cyclic Circuits
ru: Циклические схемы

# example.srLatchLED.name
source: SR Latch with LEDs
ru: SR-триггер со светодиодами

# example.srLatchLED.desc
source: SR latch with LED visualization. Press S to set, R to reset. LEDs show Q and Q' states.
ru: SR-триггер с визуализацией через LED. Нажмите S для установки, R для сброса. Светодиоды показывают Q и Q' состояния.

# example.srLatchLED.category
source: Cyclic Circuits
ru: Циклические схемы

# example.relayLatch.name
source: Relay Latch
ru: Защёлка на реле

# example.relayLatch.desc
source: Self-holding relay with feedback. Press Set — bulb turns on and stays on. NO contact holds the coil energized.
ru: Самоудерживающееся реле с обратной связью. Нажмите Set — лампа включится и останется включённой. NO контакт удерживает катушку.

# example.relayLatch.category
source: Cyclic Circuits
ru: Циклические схемы

# example.relaySwitch.name
source: Relay Switch
ru: Переключающее реле

# example.relaySwitch.desc
source: Relay switches between two LEDs. When released — red (NC), when pressed — green (NO). Demonstrates switching contacts.
ru: Реле переключает между двумя LED. Без нажатия — красный (NC), при нажатии — зелёный (NO). Демонстрирует переключающие контакты.

# example.relaySwitch.category
source: Physical Components
ru: Физические компоненты

# example.andFromNand.name
source: AND from NAND
ru: И из И-НЕ

# example.andFromNand.desc
source: AND gate implementation using NAND — demonstrates NAND universality
ru: Реализация И через И-НЕ — демонстрация универсальности И-НЕ

# example.andFromNand.category
source: Logic
ru: Логика

# example.xorFromBasic.name
source: XOR from Basic Gates
ru: Исключающее ИЛИ из базовых элементов

# example.xorFromBasic.desc
source: XOR from AND, OR and NOT — shows how complex gates are built from simple ones
ru: Исключающее ИЛИ из И, ИЛИ и НЕ — показывает как сложные элементы строятся из простых

# example.xorFromBasic.category
source: Logic
ru: Логика

# example.multiplexer.name
source: 2:1 Multiplexer
ru: Мультиплексор 2:1

# example.multiplexer.desc
source: 2:1 Multiplexer — selects one of two inputs based on selector
ru: Мультиплексор 2:1 — выбирает один из двух входов по селектору

# example.multiplexer.category
source: Data Routing
ru: Маршрутизация данных

# example.simpleLED.name
source: Simple LED Circuit
ru: Простая схема со светодиодом

# example.simpleLED.desc
source: Basic circuit with a switch and LED. Turn the switch on to light up the LED.
ru: Базовая схема с переключателем и светодиодом. Включите переключатель, чтобы зажечь LED.

# example.simpleLED.category
source: Physical Components
ru: Физические компоненты

# example.buttonLED.name
source: Push Button LED
ru: Кнопка со светодиодом

# example.buttonLED.desc
source: Press both buttons simultaneously to light the LED. Demonstrates AND logic with physical components.
ru: Нажмите обе кнопки одновременно, чтобы зажечь светодиод. Демонстрирует логику И с физическими компонентами.

# example.buttonLED.category
source: Physical Components
ru: Физические компоненты

# example.relay.name
source: Relay Circuit
ru: Схема с реле

# example.relay.desc
source: Control a high-power bulb with a small switch using a relay. The relay acts as an electromagnetic switch.
ru: Управление мощной лампой маленьким переключателем через реле. Реле работает как электромагнитный выключатель.

# example.relay.category
source: Physical Components
ru: Физические компоненты

# example.buzzer.name
source: Buzzer Alarm
ru: Сигнализация с зуммером

# example.buzzer.desc
source: Simple alarm system. Press any button to activate the buzzer and LED. Uses OR gate logic.
ru: Простая система сигнализации. Нажмите любую кнопку, чтобы активировать зуммер и светодиод. Использует логику ИЛИ.

# example.buzzer.category
source: Physical Components
ru: Физические компоненты

# example.traffic.name
source: Traffic Light Controller
ru: Контроллер светофора

# example.traffic.desc
source: Simple traffic light logic. Different button combinations produce different light signals: Red (both off), Yellow (one on), Green (both on).
ru: Простая логика светофора. Разные комбинации кнопок создают разные сигналы: Красный (обе выкл), Жёлтый (одна вкл), Зелёный (обе вкл).

# example.traffic.category
source: Physical Components
ru: Физические компоненты

# example.binaryCalculator.name
source: 4-Bit Calculator
ru: 4-битный калькулятор

# example.binaryCalculator.desc
source: Full 4-bit binary calculator. Adds two 4-bit numbers (A0-A3 + B0-B3) using a chain of full adders. Result (0-31) displayed on 8-bit display with seven-segment indicators.
ru: Полноценный 4-битный двоичный калькулятор. Складывает два 4-битных числа (A0-A3 + B0-B3) используя цепочку полных сумматоров. Результат (0-31) отображается на 8-битном дисплее с семисегментными индикаторами.

# example.binaryCalculator.category
source: Arithmetic Circuits
ru: Арифметические схемы

# example.blinkingLED.name
source: Blinking LED
ru: Мигающий светодиод

# example.blinkingLED.desc
source: LED that blinks automatically using a clock generator. The LED turns on and off every second.
ru: Светодиод, который автоматически мигает с помощью генератора импульсов. LED включается и выключается каждую секунду.

# example.blinkingLED.category
source: Clock Circuits
ru: Циклические схемы

# example.clockBuzzer.name
source: Repeating Alarm
ru: Повторяющаяся сигнализация

# example.clockBuzzer.desc
source: Clock-driven alarm with buzzer and LED. Creates a periodic beeping sound and blinking light every second.
ru: Сигнализация с зуммером и светодиодом, управляемая генератором. Создаёт периодический звуковой сигнал и мигающий свет каждую секунду.

# example.clockBuzzer.category
source: Clock Circuits
ru: Циклические схемы

# gateInstance.inputA
source: Input A
ru: Вход A

# gateInstance.inputB
source: Input B
ru: Вход B

# gateInstance.inputCin
source: Cin
ru: Перенос вход

# gateInstance.inputSelect
source: Select
ru: Селектор

# gateInstance.inputS
source: S (Set)
ru: S (Установка)

# gateInstance.inputR
source: R (Reset)
ru: R (Сброс)

# gateInstance.inputD
source: D (Data)
ru: D (Данные)

# gateInstance.inputClk
source: CLK (Clock)
ru: CLK (Тактовый сигнал)

# gateInstance.outputSum
source: Sum
ru: Сумма

# gateInstance.outputCarry
source: Carry
ru: Перенос

# gateInstance.outputCout
source: Cout
ru: Перенос выход

# gateInstance.outputOut
source: Out
ru: Выход

# gateInstance.outputOutput
source: Output
ru: Выход

# gateInstance.outputXor
source: A XOR B
ru: A Искл.ИЛИ B

# gateInstance.outputOscillator
source: Oscillator
ru: Генератор

# panel.save.title
source: Save Workspace
ru: Сохранить рабочее пространство

# panel.export.title
source: Export Circuit as JSON
ru: Экспортировать схему как JSON

# panel.export.message
source: Choose where to save your circuit
ru: Выберите куда сохранить схему

# panel.exportPNG.title
source: Export Circuit as PNG
ru: Экспортировать схему как PNG

# panel.exportPNG.message
source: Choose where to save your circuit image
ru: Выберите куда сохранить изображение схемы

# common.cancel
source: Cancel
ru: Отменить

# common.ok
source: OK
ru: ОК

# common.save
source: Save
ru: Сохранить

# common.load
source: Load
ru: Загрузить

# common.delete
source: Delete
ru: Удалить

# common.close
source: Close
ru: Закрыть

# menu.file.new
source: New Document
ru: Новый документ

# menu.file.open
source: Open...
ru: Открыть...

# menu.file.save
source: Save
ru: Сохранить

# menu.file.saveAs
source: Save As...
ru: Сохранить как...

# menu.edit.undo
source: Undo
ru: Отменить

# menu.edit.redo
source: Redo
ru: Повторить

# menu.edit.cut
source: Cut
ru: Вырезать

# menu.edit.copy
source: Copy
ru: Копировать

# menu.edit.paste
source: Paste
ru: Вставить

# menu.edit.delete
source: Delete Selected
ru: Удалить выбранное

# menu.edit.selectAll
source: Select All Gates
ru: Выбрать все элементы

# menu.edit.deselectAll
source: Deselect All
ru: Снять выделение

# menu.view
source: View
ru: Вид

# menu.view.zoomIn
source: Zoom In
ru: Увеличить

# menu.view.zoomOut
source: Zoom Out
ru: Уменьшить

# menu.view.zoomReset
source: Reset Zoom
ru: Сбросить масштаб

# menu.view.toggleSidebar
source: Toggle Sidebar
ru: Показать/Скрыть боковую панель

# menu.view.toggleInspector
source: Toggle Inspector
ru: Показать/Скрыть инспектор

# menu.circuit
source: Circuit
ru: Схема

# menu.circuit.simulate
source: Run Simulation
ru: Запустить симуляцию

# menu.circuit.export.json
source: Export as JSON...
ru: Экспортировать как JSON...

# menu.circuit.export.png
source: Export as PNG...
ru: Экспортировать как PNG...

# menu.help
source: Help
ru: Справка

# startscreen.description.title
source: Visual Logic Circuit Editor
ru: Визуальный редактор логических схем

# startscreen.description.detail
source: Create and test logic circuits with an intuitive interface. Support for all major logic gates and operations.
ru: Создавайте и тестируйте логические схемы с помощью интуитивного интерфейса. Поддержка всех основных логических элементов и операций.

# startscreen.feature.gates.title
source: 16 Gate Types
ru: 16 типов вентилей

# startscreen.feature.gates.description
source: AND, OR, NOT, XOR, NAND, NOR and more
ru: AND, OR, NOT, XOR, NAND, NOR и другие

# startscreen.feature.wires.title
source: Visual Connections
ru: Визуальные связи

# startscreen.feature.wires.description
source: Connect elements with wires
ru: Соединяйте элементы проводами

# startscreen.feature.simulation.title
source: Real-time Simulation
ru: Симуляция в реальном времени

# startscreen.feature.simulation.description
source: Instant circuit verification
ru: Мгновенная проверка работы схемы

# startscreen.feature.save.title
source: Project Saving
ru: Сохранение проектов

# startscreen.feature.save.description
source: JSON format for sharing circuits
ru: JSON формат для обмена схемами

# startscreen.button.new
source: Create New Circuit
ru: Создать новую схему

# startscreen.button.open
source: Open Circuit...
ru: Открыть схему...

# startscreen.recent.title
source: Recent Circuits
ru: Недавние схемы

# startscreen.recent.clear
source: Clear
ru: Очистить

# startscreen.recent.empty.title
source: No Recent Files
ru: Нет недавних файлов

# startscreen.recent.empty.description
source: Opened circuits will appear here
ru: Открытые схемы будут отображаться здесь

# startscreen.recent.remove
source: Remove from list
ru: Удалить из списка

# about.description.title
source: Visual Logic Circuit Editor
ru: Визуальный редактор логических схем

# about.description.detail
source: Create and simulate boolean circuits
ru: Создавайте и симулируйте булевы схемы

# about.developer.title
source: Developer
ru: Разработчик

# close.confirm.title
source: Save Changes?
ru: Сохранить изменения?

# close.confirm.message
source: Your circuit has unsaved changes.
ru: Ваша схема содержит несохраненные изменения.

# close.confirm.save
source: Save
ru: Сохранить

# close.confirm.discard
source: Don't Save
ru: Не сохранять

# close.confirm.cancel
source: Cancel
ru: Отменить

# settings.title
source: Settings
ru: Настройки

# settings.section.grid
source: Grid
ru: Сетка

# settings.section.general
source: General
ru: Общие

# settings.grid.show
source: Show Grid
ru: Показывать сетку

# settings.grid.snap
source: Snap to Grid
ru: Привязка к сетке

# settings.grid.size
source: Grid Size
ru: Размер сетки

# settings.general.autosave
source: Auto-save
ru: Автосохранение

# settings.general.theme
source: Theme
ru: Тема

# settings.theme.system
source: System
ru: Системная

# settings.theme.light
source: Light
ru: Светлая

# settings.theme.dark
source: Dark
ru: Темная

# settings.close
source: Close
ru: Закрыть

# menu.settings
source: Settings...
ru: Настройки...

# settings.section.sound
source: Sound
ru: Звук

# settings.sound.buzzer
source: Buzzer Sound
ru: Звук зуммера

# settings.sound.type
source: Sound Type
ru: Тип звука

# settings.sound.beep
source: Beep
ru: Бип

# settings.sound.alarm
source: Alarm
ru: Сигнал

# settings.sound.tone
source: Tone
ru: Тон

# help.section.gettingStarted
source: Getting Started
ru: Начало работы

# help.section.components
source: Components
ru: Компоненты

# help.section.advanced
source: Advanced
ru: Расширенные

# help.quickStart
source: Quick Start
ru: Быстрый старт

# help.basics
source: Basics
ru: Основы

# help.interface
source: Interface
ru: Интерфейс

# help.logicGates
source: Logic Gates
ru: Логические элементы

# help.physicalComponents
source: Physical Components
ru: Физические компоненты

# help.transistors
source: Transistors
ru: Транзисторы

# help.circuits
source: Building Circuits
ru: Построение схем

# help.simulation
source: Simulation
ru: Симуляция

# help.examples
source: Examples
ru: Примеры

# help.quickStart.title
source: Quick Start Guide
ru: Быстрый старт

# help.quickStart.content
source: Welcome to Bools! This guide will help you create your first logic circuit in just 4 steps.
ru: Добро пожаловать в Bools! Это руководство поможет вам создать свою первую логическую схему всего за 4 шага.

# help.step1
source: Create Gates
ru: Создайте элементы

# help.step1.desc
source: Drag logic gates from the sidebar onto the canvas. Choose from AND, OR, NOT, and many more.
ru: Перетащите логические элементы с боковой панели на холст. Выбирайте из AND, OR, NOT и многих других.

# help.step2
source: Connect Wires
ru: Соедините провода

# help.step2.desc
source: Click and drag from an output pin to an input pin to create a connection.
ru: Нажмите и перетащите из выходного контакта на входной контакт, чтобы создать соединение.

# help.step3
source: Set Inputs
ru: Установите входы

# help.step3.desc
source: Toggle input gates to set signal values. The circuit updates in real-time.
ru: Переключайте входные элементы, чтобы задать значения сигналов. Схема обновляется в реальном времени.

# help.step4
source: View Results
ru: Посмотрите результат

# help.step4.desc
source: Watch the signals flow through your circuit. Output gates show the result.
ru: Наблюдайте, как сигналы проходят через вашу схему. Выходные элементы показывают результат.

# help.basics.title
source: Understanding Logic Gates
ru: Понимание логических элементов

# help.basics.content
source: Logic gates are the building blocks of digital circuits. Each gate takes one or more inputs and produces an output based on a specific logical operation. Digital signals can be either 0 (false/low) or 1 (true/high). In Bools: • Green light = 1 (true) • Grey/dim = 0 (false) Gates process these signals according to their logic rules.
ru: Логические элементы являются строительными блоками цифровых схем. Каждый элемент принимает один или более входов и выдаёт выход в соответствии со специфической логической операцией. Цифровые сигналы могут быть либо 0 (ложь/низкий уровень), либо 1 (истина/высокий уровень). В Bools: • Зелёный свет = 1 (истина) • Серый/тусклый = 0 (ложь) Элементы обрабатывают эти сигналы в соответствии с их логическими правилами.

# help.interface.title
source: User Interface
ru: Пользовательский интерфейс

# help.interface.content
source: The interface consists of three main areas: • Toolbar: Quick access buttons for common operations • Sidebar: Gate palette for dragging gates onto the canvas • Canvas: Main work area where you design circuits • Inspector: Shows properties of selected gates You can toggle the sidebar and inspector with keyboard shortcuts ⌘1 and ⌘2.
ru: Интерфейс состоит из трёх основных областей: • Панель инструментов: Быстрый доступ к часто используемым операциям • Боковая панель: Палитра элементов для перетаскивания на холст • Холст: Основная рабочая область для проектирования схем • Инспектор: Показывает свойства выбранных элементов Вы можете переключать боковую панель и инспектор с помощью горячих клавиш ⌘1 и ⌘2.

# help.logicGates.title
source: Logic Gates Reference
ru: Справка по логическим элементам

# help.logicGates.content
source: Bools includes 16 different logic gate types: Basic Gates: AND, OR, NOT Advanced: XOR, NAND, NOR, XNOR Special: Implication gates, projection gates Input/Output: INPUT and OUTPUT gates for setting and reading signals Constants: Always 0 or Always 1 Each gate has a specific truth table that defines its behavior.
ru: Bools включает 16 различных типов логических элементов: Базовые элементы: AND, OR, NOT Расширенные: XOR, NAND, NOR, XNOR Специальные: Элементы импликации, проекции Ввод/Вывод: INPUT и OUTPUT для задания и считывания сигналов Константы: Всегда 0 или Всегда 1 Каждый элемент имеет специфическую таблицу истинности, которая определяет его поведение.

# help.physicalComponents.title
source: Physical Components
ru: Физические компоненты

# help.physicalComponents.content
source: Beyond pure logic gates, Bools includes realistic physical components: • Button: Momentary switch - active only when pressed • Switch: Toggle switch - maintains state until flipped • LED: Light-emitting diode - glows green when active • Bulb: Incandescent light - glows yellow when powered • Relay: Electromagnetic switch with COM, NO, NC contacts • Buzzer: Emits sound when activated • Battery: Power source • Resistor & Capacitor: Passive components These components let you design practical circuits.
ru: Помимо чистых логических элементов, Bools включает реалистичные физические компоненты: • Кнопка: Кратковременный переключатель - активна только при нажатии • Переключатель: Тумблер - сохраняет состояние до следующего переключения • Светодиод: Полупроводниковый прибор - загорается зелёным при активации • Лампа: Лампа накаливания - загорается жёлтым при питании • Реле: Электромагнитный переключатель с контактами COM, NO, NC • Зуммер: Издаёт звук при активации • Батарея: Источник питания • Резистор и конденсатор: Пассивные компоненты Эти компоненты позволяют вам проектировать практические схемы.

# help.transistors.title
source: Transistors
ru: Транзисторы

# help.transistors.content
source: Transistors are active components that can amplify or switch signals: • BJT (Bipolar Junction Transistor): - NPN: Conducts when base is high - PNP: Conducts when base is low • MOSFET (Metal-Oxide-Semiconductor): - N-channel: Conducts when gate is high - P-channel: Conducts when gate is low Transistors are commonly used in amplifier circuits and logic circuit implementations.
ru: Транзисторы - это активные компоненты, которые могут усиливать или переключать сигналы: • BJT (биполярный транзистор): - NPN: Проводит, когда база высокая - PNP: Проводит, когда база низкая • MOSFET (полевой транзистор): - N-канальный: Проводит, когда затвор высокий - P-канальный: Проводит, когда затвор низкий Транзисторы обычно используются в усилительных схемах и реализациях логических цепей.

# help.circuits.title
source: Building Circuits
ru: Построение схем

# help.circuits.content
source: To create a circuit: 1. Add gates from the sidebar 2. Arrange them logically on the canvas 3. Connect outputs to inputs with wires 4. Set input values to test 5. Observe the signal flow Tips: • Use INPUT gates to manually set test values • Use OUTPUT gates to display results • Organize gates left-to-right for clarity • Group related gates together • Use the inspector to rename gates for documentation
ru: Чтобы создать схему: 1. Добавьте элементы с боковой панели 2. Расположите их логически на холсте 3. Соедините выходы с входами проводами 4. Установите входные значения для тестирования 5. Наблюдайте прохождение сигнала Советы: • Используйте INPUT элементы для ручного задания тестовых значений • Используйте OUTPUT элементы для отображения результатов • Организуйте элементы слева направо для ясности • Группируйте связанные элементы вместе • Используйте инспектор для переименования элементов в целях документирования

# help.simulation.title
source: Real-time Simulation
ru: Симуляция в реальном времени

# help.simulation.content
source: Bools simulates your circuit in real-time as you modify it. The simulation engine: • Calculates all gate outputs based on inputs • Handles complex circuits with loops • Updates instantly when you change inputs • Shows signal values on connecting wires • Detects and handles circular dependencies Watch the green and grey indicator lights to see signal flow through your circuit.
ru: Bools симулирует вашу схему в реальном времени по мере её изменения. Отличительные черты симулятора: • Вычисляет выходы всех элементов на основе входов • Обрабатывает сложные схемы с циклами • Обновляется мгновенно при изменении входов • Показывает значения сигналов на соединяющих проводах • Обнаруживает и обрабатывает циклические зависимости Наблюдайте за зелёными и серыми индикаторами, чтобы увидеть прохождение сигнала через вашу схему.

# help.examples.title
source: Learning Examples
ru: Примеры для обучения

# help.examples.content
source: Bools includes example circuits to help you learn: • Half Adder: Add two binary numbers • Full Adder: Three-bit addition • SR Latch: Basic memory circuit • D Flip-Flop: Synchronized memory • Ring Oscillator: Self-oscillating circuit • Relay circuits: Physical component examples • Traffic Light Controller: Multi-output logic Load examples from the toolbar or try building your own variations!
ru: Bools включает примеры схем, которые помогут вам учиться: • Полусумматор: Складывает два двоичных числа • Полный сумматор: Сложение трёх битов • SR-триггер: Базовая схема памяти • D-триггер: Синхронная память • Кольцевой генератор: Самоколебательная схема • Схемы с реле: Примеры физических компонентов • Контроллер светофора: Логика с несколькими выходами Загружайте примеры с панели инструментов или попробуйте создавать свои вариации!

# sidebar.section.flipflops
source: Flip-Flops
ru: Триггеры

# sidebar.section.multiplexers
source: Multiplexers
ru: Мультиплексоры

# sidebar.section.counters
source: Counters & Registers
ru: Счетчики и регистры

# sidebar.section.adders
source: Adders
ru: Сумматоры

# sidebar.section.decoders
source: Decoders & Encoders
ru: Декодеры и энкодеры

# sidebar.section.comparators
source: Comparators
ru: Компараторы

# sidebar.section.memory
source: Memory
ru: Память

# sidebar.section.timing
source: Timing
ru: Генераторы

# sidebar.section.bus
source: Bus Components
ru: Шины

# gate.d_flipflop
source: D Flip-Flop
ru: D-триггер

# gate.t_flipflop
source: T Flip-Flop
ru: T-триггер

# gate.jk_flipflop
source: JK Flip-Flop
ru: JK-триггер

# gate.sr_latch
source: SR Latch
ru: SR-защелка

# gate.desc.d_flipflop
source: D Flip-Flop - stores value on CLK edge
ru: D-триггер - сохраняет значение по фронту CLK

# gate.desc.t_flipflop
source: T Flip-Flop - toggles on CLK edge
ru: T-триггер - переключается по фронту CLK

# gate.desc.jk_flipflop
source: JK Flip-Flop - universal flip-flop
ru: JK-триггер - универсальный триггер

# gate.desc.sr_latch
source: SR Latch - basic memory circuit
ru: SR-защелка - базовая схема памяти

# gate.mux_2to1
source: MUX 2:1
ru: МУКс 2:1

# gate.mux_4to1
source: MUX 4:1
ru: МУКс 4:1

# gate.demux_1to2
source: DEMUX 1:2
ru: Демукс 1:2

# gate.demux_1to4
source: DEMUX 1:4
ru: Демукс 1:4

# gate.desc.mux_2to1
source: Multiplexer 2:1 - selects 1 of 2 inputs
ru: Мультиплексор 2:1 - выбирает 1 из 2 входов

# gate.desc.mux_4to1
source: Multiplexer 4:1 - selects 1 of 4 inputs
ru: Мультиплексор 4:1 - выбирает 1 из 4 входов

# gate.desc.demux_1to2
source: Demultiplexer 1:2 - routes to 1 of 2 outputs
ru: Демультиплексор 1:2 - направляет на 1 из 2 выходов
